InformationRegisters/АС_ВидыЦенКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АС_ВидыЦенКонтрагентов</Name>
			<Comment>Один автоматически применяемый вид цены для каждого контрагента.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/АС_ЦенообразованиеСервер/Ext/Module.bsl
Функция ВидЦенКонтрагента(Контрагент) Экспорт

	Если ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты")
		Или Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|    ВидыЦенКонтрагентов.ВидЦен КАК ВидЦен
	|ИЗ
	|    РегистрСведений.АС_ВидыЦенКонтрагентов КАК ВидыЦенКонтрагентов
	|ГДЕ
	|    ВидыЦенКонтрагентов.Контрагент = &Контрагент
	|    И НЕ ВидыЦенКонтрагентов.ВидЦен.ПометкаУдаления";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидЦен;
	КонецЕсли;

	Возврат ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");

КонецФункции
